nickfox-taterli/x-cube-cryptolib/Fw_Crypto/STM32F0/Drivers/BSP/STM32091C_EVAL/stm32091c_eval_cec.c
      if (HDMI_CEC_ROOT == 0x1)
      {
        /* Sink Physical Address discovery */
        errorstatus = HDMI_CEC_SinkPhysicalAddressDiscovery();
      }
    }
  }
 
  if (errorstatus == HDMI_CEC_OK)
  {
    HAL_CEC_Receive_IT(&CecHandle, (uint8_t *)(&HDMI_CEC_RX_MessageStructPrivate));
    
    /* Report physical address */
    sendcount = 0;
    do
    {
      errorstatus = BSP_HDMI_CEC_ReportPhysicalAddress();
      sendcount++;
    } while ((errorstatus != HDMI_CEC_OK) && sendcount < 0x5);
  }
  
  return errorstatus;
}

/**
  * @brief  Transmit message by taking data from typedef struct CEC_Meassage
  * @param  CEC_TX_MessageStructure: pointer to an CEC_Message structure that contains
  *         the message to be sent.
  * @retval HDMI_CEC_Error: CEC Error code
  */
HDMI_CEC_Error BSP_HDMI_CEC_TransmitMessage(HDMI_CEC_Message *HDMI_CEC_TX_MessageStructure)
{
  HAL_StatusTypeDef halstatus;
  __IO uint32_t j = 0;
  uint8_t length = HDMI_CEC_TX_MessageStructure->TxMessageLength;
  uint32_t BufferCount = 0;
  uint32_t tickstart = HAL_GetTick();

  /* Wait the end of the previous transmission */
  while (SendFrame != 0)
  {
    if((HAL_GetTick()-tickstart) <= HDMI_CEC_TIMEOUT_VALUE)
    {
      return HDMI_CEC_TIMEOUT;
    }
  }
  SendFrame = 1;
  SendStatus = 0;
  /*BufferCount = 0;*/

  /* Initialize BufferPointer */
  for (j = 0; j < 15; j++)
  {
    BufferPointer[j] = 0;
  }

  BufferPointer[0] =  HDMI_CEC_TX_MessageStructure->Opcode;

  for (BufferCount = 1; BufferCount < length + 1; BufferCount++)
  {
    BufferPointer[BufferCount] = HDMI_CEC_TX_MessageStructure->Operande[BufferCount - 1];
  }

  halstatus = HAL_CEC_Transmit_IT(&CecHandle, HDMI_CEC_TX_MessageStructure->Header, (uint8_t *)BufferPointer, (length+1));
  /*halstatus = HAL_CEC_Transmit(&CecHandle, HDMI_CEC_TX_MessageStructure->Header, (uint8_t *)BufferPointer, (length+1), HDMI_CEC_TIMEOUT_VALUE);
  SendFrame = 0;*/

  if (halstatus == HAL_OK)
  {
    return HDMI_CEC_OK;
  }
  else
  {
    return HDMI_CEC_TX_ERROR ;
  }
}

/**
  * @brief  Get the ISR register status.
  * @param  None
  * @retval HDMI_CEC_Error: CEC Error code
  */
HAL_CEC_ErrorTypeDef BSP_HDMI_CEC_GetErrorStatus (void)
{
  return ((HAL_CEC_ErrorTypeDef)HAL_CEC_GetError(&CecHandle));
}

/**
  * @brief Tx Transfer completed callback
  * @param hcec: CEC handle
  * @retval None
  */
void HAL_CEC_TxCpltCallback(CEC_HandleTypeDef *hcec)
{
  SendFrame = 0;
  SendStatus = SUCCESS;
  
  if (__HAL_CEC_GET_IT_SOURCE(hcec, CEC_IER_RXENDIE))
  {
    hcec->State = HAL_CEC_STATE_STANDBY_RX;
  }
}

/**
  * @brief Rx Transfer completed callback
  * @param hcec: CEC handle
  * @retval None
  */
void HAL_CEC_RxCpltCallback(CEC_HandleTypeDef *hcec)
{
  if (hcec->RxXferSize == 1)
  {
    HDMI_CEC_RX_MessageStructPrivate.RxMessageLength = hcec->RxXferSize;
  }
  else
  {
    HDMI_CEC_RX_MessageStructPrivate.RxMessageLength = hcec->RxXferSize-1;
    ReceivedFrame = 1;
  }

  ReceiveStatus = SUCCESS;

  HAL_CEC_Receive_IT(hcec, (uint8_t *)(&HDMI_CEC_RX_MessageStructPrivate));
}

/**
  * @brief CEC error callbacks
  * @param hcec: CEC handle
  * @retval None
  */
void HAL_CEC_ErrorCallback(CEC_HandleTypeDef *hcec)
{
  HAL_CEC_ErrorTypeDef errorstatus;
  errorstatus = BSP_HDMI_CEC_GetErrorStatus();
  
  if ((errorstatus & (HAL_CEC_ERROR_RXOVR | HAL_CEC_ERROR_BRE | HAL_CEC_ERROR_SBPE | 
                      HAL_CEC_ERROR_LBPE | HAL_CEC_ERROR_RXACKE)) != 0)
  {
    ReceiveStatus  = 0;
    /*ReceivedFrame  = 1;*/
  }
  
  if ((errorstatus & (HAL_CEC_ERROR_ARBLST | HAL_CEC_ERROR_TXUDR | 
                      HAL_CEC_ERROR_TXERR | HAL_CEC_ERROR_TXACKE)) != 0)
  {
    TransErrorCode = errorstatus;
    SendFrame = 0;
    SendStatus = 0;
  }
  
  /* Re-initialize CEC */
  __HAL_CEC_DISABLE_IT(hcec, (CEC_IER_TX_ALL_ERR | CEC_IER_RX_ALL_ERR | 
                              CEC_IER_TXBRIE | CEC_IER_TXENDIE | 
                              CEC_IER_RXBRIE | CEC_IER_RXENDIE)); 
  HAL_CEC_DeInit(hcec);
  HAL_CEC_Init(hcec);
  HAL_CEC_Receive_IT(hcec, (uint8_t *)(&HDMI_CEC_RX_MessageStructPrivate));
}

/**
  * @brief  Report physical address to all other devices thus allowing any
            device to create a map of the network.
  * @param  None
  * @retval HDMI_CEC_Error: CEC Error code.
  */
HDMI_CEC_Error BSP_HDMI_CEC_ReportPhysicalAddress(void)
{
  HDMI_CEC_TX_MessageStructPrivate.Header = (0xF);
  HDMI_CEC_TX_MessageStructPrivate.Opcode = HDMI_CEC_OPCODE_REPORT_PHYSICAL_ADDRESS;
  HDMI_CEC_TX_MessageStructPrivate.Operande[0] = MyPhysicalAddress >> 8;
  HDMI_CEC_TX_MessageStructPrivate.Operande[1] = MyPhysicalAddress & 0xFF;
  HDMI_CEC_TX_MessageStructPrivate.Operande[2] = DeviceType;
  HDMI_CEC_TX_MessageStructPrivate.TxMessageLength = 0x03;

  return (BSP_HDMI_CEC_TransmitMessage(&HDMI_CEC_TX_MessageStructPrivate));
}

/**
  * @brief  Handle CEC command receive callback.
  *         When receiving the STANDBY Opcode command, the system is entered in
  *         Stop mode and when wakeup, the clock configuration shall be restored.
  * @param  None
  * @retval None
  */
void BSP_HDMI_CEC_CommandCallBack(void)
{
  uint8_t i = 0, sendcount = 0;
  HDMI_CEC_Error errorstatus = HDMI_CEC_OK;
  
  ReceivedFrame = 0;

  switch (HDMI_CEC_RX_MessageStructPrivate.Opcode)
  {
    case HDMI_CEC_OPCODE_REPORT_PHYSICAL_ADDRESS:
      HDMI_CEC_MapStruct.PhysicalAddress_A = HDMI_CEC_RX_MessageStructPrivate.Operande[1] >> 4;
      HDMI_CEC_MapStruct.PhysicalAddress_B = HDMI_CEC_RX_MessageStructPrivate.Operande[1] & 0x0F;
      HDMI_CEC_MapStruct.PhysicalAddress_C = HDMI_CEC_RX_MessageStructPrivate.Operande[0] >> 4;
      HDMI_CEC_MapStruct.PhysicalAddress_D = HDMI_CEC_RX_MessageStructPrivate.Operande[0] & 0x0F;
      HDMI_CEC_MapStruct.LogicalAddress = (HDMI_CEC_RX_MessageStructPrivate.Header >> 0x4) & 0x0F;
      HDMI_CEC_MapStruct.DeviceType = HDMI_CEC_RX_MessageStructPrivate.Operande[2];
      HDMI_CEC_DeviceMap[DeviceCount] = HDMI_CEC_MapStruct;
      HDMI_CEC_Follower_String[(HDMI_CEC_DeviceMap[DeviceCount].LogicalAddress)][1] = (uint8_t *)"1";
      DeviceCount++;
      break;

    case HDMI_CEC_OPCODE_STANDBY:
      /* Request to enter Stop mode */
      HAL_PWR_EnterSTOPMode(PWR_MAINREGULATOR_ON, PWR_STOPENTRY_WFI);

