nickfox-taterli/x-cube-cryptolib/Fw_Crypto/STM32F0/Drivers/BSP/STM32091C_EVAL/stm32091c_eval_cec.c
  /*------------------ Logical address allocation ----------------------------*/
  /* Get the device type */
  /* Device type = CEC_TV */
  if (DeviceType == HDMI_CEC_TV)
  {
    if (HDMI_CEC_ROOT)
    {
      MyLogicalAddress = 0x00;
      CecHandle.Init.OwnAddress = (1 << 0x0); /* Own address = 0x0 */
      CecHandle.Init.InitiatorAddress = 0x0;
      HAL_CEC_Init(&CecHandle);
    }
    else
    {
      CecHandle.Init.OwnAddress = (1 << 0xE); /* Own address = 0xE */
      CecHandle.Init.InitiatorAddress = 0xE;
      HAL_CEC_Init(&CecHandle);

      halstatus = HAL_CEC_Transmit(&CecHandle, 0xE, NULL, 0, HDMI_CEC_TIMEOUT_VALUE);
      if (halstatus == HAL_TIMEOUT)
      {
        errorstatus = HDMI_CEC_TIMEOUT;
        return(errorstatus);
      }

      halerrorstatus = BSP_HDMI_CEC_GetErrorStatus();

      if ((halerrorstatus & HAL_CEC_ERROR_TXACKE) != 0)
      {
        MyLogicalAddress = 0x0E;
        /* Re-initialize CEC */
        HAL_CEC_DeInit(&CecHandle);
        HAL_CEC_Init(&CecHandle);
        errorstatus = HDMI_CEC_OK;
      }
      else if (halerrorstatus == HAL_CEC_ERROR_NONE)
      {
        MyLogicalAddress = 0x0F;
        CecHandle.Init.OwnAddress = 0xF;
        CecHandle.Init.InitiatorAddress = 0xF;
        HAL_CEC_Init(&CecHandle);
        errorstatus = HDMI_CEC_DEVICE_UNREGISTRED;
      }
    }
  }

  /* Device type = CEC_RECORDING */
  if (DeviceType == HDMI_CEC_RECORDING)
  {
    CecHandle.Init.OwnAddress = (1 << 0x1); /* Own address = 0x1 */
    CecHandle.Init.InitiatorAddress = 0x1;
    HAL_CEC_Init(&CecHandle);

    halstatus = HAL_CEC_Transmit(&CecHandle, 0x1, NULL, 0, HDMI_CEC_TIMEOUT_VALUE);
    if (halstatus == HAL_TIMEOUT)
    {
      errorstatus = HDMI_CEC_TIMEOUT;
      return(errorstatus);
    }

    halerrorstatus = BSP_HDMI_CEC_GetErrorStatus();

    if ((halerrorstatus & HAL_CEC_ERROR_TXACKE) != 0)
    {
      MyLogicalAddress = 0x01;
      /* Re-initialize CEC */
      HAL_CEC_DeInit(&CecHandle);
      HAL_CEC_Init(&CecHandle);
      errorstatus = HDMI_CEC_OK;
    }
    else if (halerrorstatus == HAL_CEC_ERROR_NONE)
    {
      CecHandle.Init.OwnAddress = (1 << 0x2); /* Own address = 0x2 */
      CecHandle.Init.InitiatorAddress = 0x2;
      HAL_CEC_Init(&CecHandle);

      halstatus = HAL_CEC_Transmit(&CecHandle, 0x2, NULL, 0, HDMI_CEC_TIMEOUT_VALUE);
      if (halstatus == HAL_TIMEOUT)
      {
        errorstatus = HDMI_CEC_TIMEOUT;
        return(errorstatus);
      }

      halerrorstatus = BSP_HDMI_CEC_GetErrorStatus();

      if ((halerrorstatus & HAL_CEC_ERROR_TXACKE) != 0)
      {
        MyLogicalAddress = 0x02;
        /* Re-initialize CEC */
        HAL_CEC_DeInit(&CecHandle);
        HAL_CEC_Init(&CecHandle);
        errorstatus = HDMI_CEC_OK;
      }
      else if (halerrorstatus == HAL_CEC_ERROR_NONE)
      {
        CecHandle.Init.OwnAddress = (1 << 0x9); /* Own address = 0x9 */
        CecHandle.Init.InitiatorAddress = 0x9;
        HAL_CEC_Init(&CecHandle);

        halstatus = HAL_CEC_Transmit(&CecHandle, 0x9, NULL, 0, HDMI_CEC_TIMEOUT_VALUE);
        if (halstatus == HAL_TIMEOUT)
        {
          errorstatus = HDMI_CEC_TIMEOUT;
          return(errorstatus);
        }

        halerrorstatus = BSP_HDMI_CEC_GetErrorStatus();

        if ((halerrorstatus & HAL_CEC_ERROR_TXACKE) != 0)
        {
          MyLogicalAddress = 0x09;
          /* Re-initialize CEC */
          HAL_CEC_DeInit(&CecHandle);
          HAL_CEC_Init(&CecHandle);
          errorstatus = HDMI_CEC_OK;
        }
        else if (halerrorstatus == HAL_CEC_ERROR_NONE)
        {
          MyLogicalAddress = 0x0F;
          CecHandle.Init.OwnAddress = 0xF;
          CecHandle.Init.InitiatorAddress = 0xF;
          HAL_CEC_Init(&CecHandle);
          errorstatus = HDMI_CEC_DEVICE_UNREGISTRED;
        }
      }
    }
  }

  /* Device type = CEC_TUNER */
  if (DeviceType == HDMI_CEC_TUNER)
  {
    CecHandle.Init.OwnAddress = (1 << 0x3); /* Own address = 0x3 */
    CecHandle.Init.InitiatorAddress = 0x3;
    HAL_CEC_Init(&CecHandle);

    halstatus = HAL_CEC_Transmit(&CecHandle, 0x3, NULL, 0, HDMI_CEC_TIMEOUT_VALUE);
    if (halstatus == HAL_TIMEOUT)
    {
      errorstatus = HDMI_CEC_TIMEOUT;
      return(errorstatus);
    }

    halerrorstatus = BSP_HDMI_CEC_GetErrorStatus();

    if ((halerrorstatus & HAL_CEC_ERROR_TXACKE) != 0)
    {
      MyLogicalAddress = 0x03;
      /* Re-initialize CEC */
      HAL_CEC_DeInit(&CecHandle);
      HAL_CEC_Init(&CecHandle);
      errorstatus = HDMI_CEC_OK;
    }
    else if (halerrorstatus == HAL_CEC_ERROR_NONE)
    {
      CecHandle.Init.OwnAddress = (1 << 0x6); /* Own address = 0x6 */
      CecHandle.Init.InitiatorAddress = 0x6;
      HAL_CEC_Init(&CecHandle);

      halstatus = HAL_CEC_Transmit(&CecHandle, 0x6, NULL, 0, HDMI_CEC_TIMEOUT_VALUE);
      if (halstatus == HAL_TIMEOUT)
      {
        errorstatus = HDMI_CEC_TIMEOUT;
        return(errorstatus);
      }

      halerrorstatus = BSP_HDMI_CEC_GetErrorStatus();

      if ((halerrorstatus & HAL_CEC_ERROR_TXACKE) != 0)
      {
        MyLogicalAddress = 0x06;
        /* Re-initialize CEC */
        HAL_CEC_DeInit(&CecHandle);
        HAL_CEC_Init(&CecHandle);
        errorstatus = HDMI_CEC_OK;
      }
      else if (halerrorstatus == HAL_CEC_ERROR_NONE)
      {
        CecHandle.Init.OwnAddress = (1 << 0x7); /* Own address = 0x7 */
        CecHandle.Init.InitiatorAddress = 0x7;
        HAL_CEC_Init(&CecHandle);

        halstatus = HAL_CEC_Transmit(&CecHandle, 0x7, NULL, 0, HDMI_CEC_TIMEOUT_VALUE);
        if (halstatus == HAL_TIMEOUT)
        {
          errorstatus = HDMI_CEC_TIMEOUT;
          return(errorstatus);
        }

        halerrorstatus = BSP_HDMI_CEC_GetErrorStatus();

        if ((halerrorstatus & HAL_CEC_ERROR_TXACKE) != 0)
        {
          MyLogicalAddress = 0x07;
          /* Re-initialize CEC */
          HAL_CEC_DeInit(&CecHandle);
          HAL_CEC_Init(&CecHandle);
          errorstatus = HDMI_CEC_OK;
        }
        else if (halerrorstatus == HAL_CEC_ERROR_NONE)
        {
          CecHandle.Init.OwnAddress = (1 << 0xA); /* Own address = 0xA */
          CecHandle.Init.InitiatorAddress = 0xA;
          HAL_CEC_Init(&CecHandle);

