nickfox-taterli/x-cube-cryptolib/Fw_Crypto/STM32F0/Drivers/BSP/STM32091C_EVAL/stm32091c_eval_cec.c
          halstatus = HAL_CEC_Transmit(&CecHandle, 0xA, NULL, 0, HDMI_CEC_TIMEOUT_VALUE);
          if (halstatus == HAL_TIMEOUT)
          {
            errorstatus = HDMI_CEC_TIMEOUT;
            return(errorstatus);
          }

          halerrorstatus = BSP_HDMI_CEC_GetErrorStatus();

          if ((halerrorstatus & HAL_CEC_ERROR_TXACKE) != 0)
          {
            MyLogicalAddress = 0x0A;
            /* Re-initialize CEC */
            HAL_CEC_DeInit(&CecHandle);
            HAL_CEC_Init(&CecHandle);
            errorstatus = HDMI_CEC_OK;
          }
          else if (halerrorstatus == HAL_CEC_ERROR_NONE)
          {
            MyLogicalAddress = 0x0F;
            CecHandle.Init.OwnAddress = 0xF;
            CecHandle.Init.InitiatorAddress = 0xF;
            HAL_CEC_Init(&CecHandle);
            errorstatus = HDMI_CEC_DEVICE_UNREGISTRED;
          }
        }
      }
    }
  }

  /* Device type = CEC_PLAYBACK */
  if (DeviceType == HDMI_CEC_PLAYBACK)
  {
    CecHandle.Init.OwnAddress = (1 << 0x4); /* Own address = 0x4 */
    CecHandle.Init.InitiatorAddress = 0x4;
    HAL_CEC_Init(&CecHandle);

    halstatus = HAL_CEC_Transmit(&CecHandle, 0x4, NULL, 0, HDMI_CEC_TIMEOUT_VALUE);
    if (halstatus == HAL_TIMEOUT)
    {
      errorstatus = HDMI_CEC_TIMEOUT;
      return(errorstatus);
    }

    halerrorstatus = BSP_HDMI_CEC_GetErrorStatus();

    if ((halerrorstatus & HAL_CEC_ERROR_TXACKE) != 0)
    {
      MyLogicalAddress = 0x04;
      /* Re-initialize CEC */
      HAL_CEC_DeInit(&CecHandle);
      HAL_CEC_Init(&CecHandle);
      errorstatus = HDMI_CEC_OK;
    }
    else if (halerrorstatus == HAL_CEC_ERROR_NONE)
    {
      CecHandle.Init.OwnAddress = (1 << 0x8); /* Own address = 0x8 */
      CecHandle.Init.InitiatorAddress = 0x8;
      HAL_CEC_Init(&CecHandle);

      halstatus = HAL_CEC_Transmit(&CecHandle, 0x8, NULL, 0, HDMI_CEC_TIMEOUT_VALUE);
      if (halstatus == HAL_TIMEOUT)
      {
        errorstatus = HDMI_CEC_TIMEOUT;
        return(errorstatus);
      }

      halerrorstatus = BSP_HDMI_CEC_GetErrorStatus();

      if ((halerrorstatus & HAL_CEC_ERROR_TXACKE) != 0)
      {
        MyLogicalAddress = 0x08;
        /* Re-initialize CEC */
        HAL_CEC_DeInit(&CecHandle);
        HAL_CEC_Init(&CecHandle);
        errorstatus = HDMI_CEC_OK;
      }
      else if (halerrorstatus == HAL_CEC_ERROR_NONE)
      {
        CecHandle.Init.OwnAddress = (1 << 0xB); /* Own address = 0xB */
        CecHandle.Init.InitiatorAddress = 0xB;
        HAL_CEC_Init(&CecHandle);

        halstatus = HAL_CEC_Transmit(&CecHandle, 0xB, NULL, 0, HDMI_CEC_TIMEOUT_VALUE);
        if (halstatus == HAL_TIMEOUT)
        {
          errorstatus = HDMI_CEC_TIMEOUT;
          return(errorstatus);
        }

        halerrorstatus = BSP_HDMI_CEC_GetErrorStatus();

        if ((halerrorstatus & HAL_CEC_ERROR_TXACKE) != 0)
        {
          MyLogicalAddress = 0x0B;
          /* Re-initialize CEC */
          HAL_CEC_DeInit(&CecHandle);
          HAL_CEC_Init(&CecHandle);
          errorstatus = HDMI_CEC_OK;
        }
        else if (halerrorstatus == HAL_CEC_ERROR_NONE)
        {
          MyLogicalAddress = 0x0F;
          CecHandle.Init.OwnAddress = 0xF;
          CecHandle.Init.InitiatorAddress = 0xF;
          HAL_CEC_Init(&CecHandle);
          errorstatus = HDMI_CEC_DEVICE_UNREGISTRED;
        }
      }
    }
  }

  /* Device type = CEC Audio System */
  if (DeviceType == HDMI_CEC_AUDIOSYSTEM)
  {
    CecHandle.Init.OwnAddress = (1 << 0x5); /* Own address = 0x5 */
    CecHandle.Init.InitiatorAddress = 0x5;
    HAL_CEC_Init(&CecHandle);

    halstatus = HAL_CEC_Transmit(&CecHandle, 0x5, NULL, 0, HDMI_CEC_TIMEOUT_VALUE);
    if (halstatus == HAL_TIMEOUT)
    {
      errorstatus = HDMI_CEC_TIMEOUT;
      return(errorstatus);
    }

    halerrorstatus = BSP_HDMI_CEC_GetErrorStatus();

    if ((halerrorstatus & HAL_CEC_ERROR_TXACKE) != 0)
    {
      MyLogicalAddress = 0x05;
      /* Re-initialize CEC */
      HAL_CEC_DeInit(&CecHandle);
      HAL_CEC_Init(&CecHandle);
      errorstatus = HDMI_CEC_OK;
    }
    else if (halerrorstatus == HAL_CEC_ERROR_NONE)
    {
      MyLogicalAddress = 0x0F;
      CecHandle.Init.OwnAddress = 0xF;
      CecHandle.Init.InitiatorAddress = 0xF;
      HAL_CEC_Init(&CecHandle);
      errorstatus = HDMI_CEC_DEVICE_UNREGISTRED;
    }
  }

  return errorstatus;
}

/**
  * @brief  System Clock Configuration
  *         The system Clock is configured as follow : 
  *            System Clock source            = PLL (HSE)
  *            SYSCLK(Hz)                     = 48000000
  *            HCLK(Hz)                       = 48000000
  *            AHB Prescaler                  = 1
  *            APB1 Prescaler                 = 1
  *            HSE Frequency(Hz)              = 8000000
  *            PREDIV                         = 1
  *            PLLMUL                         = 6
  *            Flash Latency(WS)              = 1
  * @param  None
  * @retval None
  */
static void SystemClock_ConfigAfterSTOP(void)
{
  RCC_ClkInitTypeDef RCC_ClkInitStruct;
  RCC_OscInitTypeDef RCC_OscInitStruct;
  
  /* Enable HSE Oscillator and activate PLL with HSE as source */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PREDIV = RCC_PREDIV_DIV1;
  RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL6;
  HAL_RCC_OscConfig(&RCC_OscInitStruct); 

  /* Select PLL as system clock source and configure the HCLK, PCLK1 clocks dividers */
  RCC_ClkInitStruct.ClockType = (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_PCLK1);
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_1); 
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
